
Функция ВыполнитьЗагрузкуДанныхPOST(Запрос)
	ДанныеКоманды = оо_HTTPСервер.СтруктураДанныеКоманды();
	ДанныеКоманды.Ответ = Новый HTTPСервисОтвет(200);
	ДанныеКоманды.Запрос = Запрос;
	
	Ответ = Новый HTTPСервисОтвет(200); 
	Ответ.Заголовки.Вставить("Content-Type", "application/json; charset=utf-8");
	
	СтруктураОтвета = Новый Структура("Успешно, Сообщение", Ложь, "");
	ТекстСообщения = "";
	
	ОписаниеПараметровЗапроса = Новый Соответствие;
	ОписаниеПараметровЗапроса.Вставить("uid",		Новый Структура("Тип,Обязательность",  Тип("УникальныйИдентификатор"),	ИСТИНА));
	ОписаниеПараметровЗапроса.Вставить("useruid",	Новый Структура("Тип,Обязательность",  Тип("УникальныйИдентификатор"),	ИСТИНА));
	ОписаниеПараметровЗапроса.Вставить("from",		Новый Структура("Тип,Обязательность",  Тип("Строка"),					ИСТИНА));
	ОписаниеПараметровЗапроса.Вставить("fileData",	Новый Структура("Тип,Обязательность",  Тип("Строка"),					ИСТИНА));
	
	ПараметрыПринятые = оо_ФункцииДляРаботыСНТТР.ПроверитьИРазобратьВходныеПараметрыЗапроса(ДанныеКоманды.тзСообщений
																						, Запрос
																						, ОписаниеПараметровЗапроса);
	
	Если ПараметрыПринятые = Неопределено Тогда
		Возврат оо_ФункцииДляРаботыСНТТР.ОтветНаЗапрос(ДанныеКоманды);
	КонецЕсли;
	
	//////////////// ВЫПОЛНЕНИЕ МЕТОДА /////////////////
	Попытка
		// Получение двоичных данных файла загрузки
		ПринятыеДвоичныеДанные = ПолучитьДвоичныеДанныеИзBase64Строки(ПараметрыПринятые.fileData);
		
		СообщениеОбОтправке = оо_HTTPСервер.ВыполнитьЗагрузкуДанныхИзФайла(ДанныеКоманды, ПринятыеДвоичныеДанные);
	Исключение
		оо_HTTPСервер.СформироватьСообщениеДляЛога(ДанныеКоманды.тзСообщений
												, "оо_HTTPОбмен.ВыполнитьЗагрузкуДанныхPOST"
												, ПодробноеПредставлениеОшибки(ИнформацияОбОшибке())
												, 40000);
	КонецПопытки;
	
	
	Возврат оо_ФункцииДляРаботыСНТТР.ОтветНаЗапрос(ДанныеКоманды);;
КонецФункции
