Функция ОшибкиПротоколаОбмена() Экспорт
	Ошибки = Новый Соответствие;
	
	Ошибки.Вставить(    0, "");
	
	Ошибки.Вставить(    1, "Нет контрагента с таким номером телефона.");
	Ошибки.Вставить(    2, "Нет контрагента с таким идентификатором.");
	Ошибки.Вставить(    3, "Нет организации с таким ИНН.");
	Ошибки.Вставить(    4, "Невозможно отправить SMS, попробуйте позже.");
	Ошибки.Вставить(    5, "Нет контрагента с таким идентификатором ЕСИА.");
  	Ошибки.Вставить(    6, "Нет договора с таким номером.");
	Ошибки.Вставить(    7, "Контрагент с таким номером телефона зарегистрирован ранее.");
	Ошибки.Вставить(    8, "Регистрация не может выполнена, анкета с такими же данными зарегистрирована ранее. Если это не вы, то обратитесь в техническую поддержку.");
	Ошибки.Вставить(    9, "Регистрация не может выполнена, анкета с таким же идентификатором зарегистрирована ранее. Если это не вы, то обратитесь в техническую поддержку.");
	Ошибки.Вставить(   10, "Не пройдена проверка анкеты, регистрация контрагента отменена.");
	Ошибки.Вставить(   11, "Ошибка при регистрации контрагента.");
	Ошибки.Вставить(   12, "Ошибка при регистрации карты.");
	Ошибки.Вставить(   13, "Сумма заявки больше допустимой");
	Ошибки.Вставить(   14, "Сумма заявки меньше допустимой");
	Ошибки.Вставить(   15, "Срок заявки больше допустимого");
	Ошибки.Вставить(   16, "Срок заявки меньше допустимого");
	Ошибки.Вставить(   17, "Наша компания не может предложить продукт для клиента вашей категории.");
	Ошибки.Вставить(   18, "Ошибка получения данных из сервиса ГосУслуги");
	Ошибки.Вставить(   19, "Ошибка получения данных");
	Ошибки.Вставить(   20, "Нет заявки с таким идентификатором.");
	Ошибки.Вставить(   21, "Ошибка получения ИНН. Проверьте введенные анкетные данные: фамилия, имя, отчество, дата рождения, серия и номер паспорта.");
	Ошибки.Вставить(   22, "Ошибка получения ИНН. В данный момент сервис не доступен. Повторите позже.");
	
	
	/////////////// Системные ошибки и инфраструктурные сбои
	Ошибки.Вставить(10001, "В запросе отсутствуют обязательные параметры");
	Ошибки.Вставить(10002, "Параметром запроса передан не объект");
	Ошибки.Вставить(10003, "В запросе отсутствуют обязательные параметры");
	Ошибки.Вставить(10004, "Ошибочные параметры сервиса отправки SMS");
	Ошибки.Вставить(10005, "Несоответствие типа параметра запроса");
	Ошибки.Вставить(10006, "Пустое значение параметра запроса");
	Ошибки.Вставить(10007, "В параметрах запроса передан неизвестный параметр");
	Ошибки.Вставить(10008, "Передан неизвестный вид телефона");
	Ошибки.Вставить(10009, "Ошибочный формат идентификатора ЕСИА");
	Ошибки.Вставить(10010, "Неизвестная версия шаблона");
	Ошибки.Вставить(10011, "Неправильные параметры");
	Ошибки.Вставить(10012, "Ошибочный формат кода АСП");
	Ошибки.Вставить(10013, "Ошибка в значении уникального идентификатора");
	Ошибки.Вставить(10014, "Ошибка в номере телефона");
	Ошибки.Вставить(10015, "Ошибка в данных пенсионного документа");
	Ошибки.Вставить(10016, "Нет карты контрагента с таким идентификатором");
	Ошибки.Вставить(10017, "Не найдена активная карта");
	Ошибки.Вставить(10018, "Карта не принадлежит контрагенту");
	Ошибки.Вставить(10019, "Карта не зарегистрирована для организации");
	Ошибки.Вставить(10020, "Ошибка удаления карты контрагента");
	Ошибки.Вставить(10021, "Не найдена анкета контрагента");
	Ошибки.Вставить(10022, "Ошибочное значение совокупного дохода контрагента");
	Ошибки.Вставить(10023, "В заявке количество фотографий меньше необходимого");
	Ошибки.Вставить(10024, "Неизвестный вид займа");
	Ошибки.Вставить(10025, "Пустые значения card_uid и requestKey");
	Ошибки.Вставить(10026, "Неизвестный источник заявки");
	Ошибки.Вставить(10027, "Ошибка региона");
	Ошибки.Вставить(10028, "Номер телефона не найден в контактных данных контрагента");
	Ошибки.Вставить(10029, "Отсутствуют данные паспорта контрагента");
	Ошибки.Вставить(10030, "Вид займа не доступен для контрагента");
	Ошибки.Вставить(10031, "По значению кода кассы не найдена касса");
	Ошибки.Вставить(10032, "Идентификатор контрагента не соответствует идентификатору ЕСИА");
	Ошибки.Вставить(10033, "Ошибка удаления клиента");
	Ошибки.Вставить(10034, "Среди активных не найдена заявка");
	Ошибки.Вставить(10035, "Ошибка добавления файлов к заявке");
	Ошибки.Вставить(10036, "Организация-владелец кассы не соответствует Организации");
	Ошибки.Вставить(10037, "IP адрес в черном списке");
	Ошибки.Вставить(10038, "Команда для Организации запрещена");
	Ошибки.Вставить(10039, "Проверка ИНН не пройдена");
	Ошибки.Вставить(10040, "Ошибка при формировании ответа");
	
	
	/////////////// Ошибки авторизации, прав доступа и сессий
	Ошибки.Вставить(20001, "Ошибка взаимодействия с сервисом Jetap");
	Ошибки.Вставить(20002, "Ошибка взаимодействия с сервисом Золотая корона"); 
	Ошибки.Вставить(20003, "Ошибка взаимодействия с сервисом Тинькофф"); 
	Ошибки.Вставить(20004, "Невозможно отправить SMS, попробуйте позже"); // "Сервис отправки SMS в данный момент не работает"
	Ошибки.Вставить(20005, "Ошибка в ответе сервиса ГосУслуги");
	Ошибки.Вставить(20006, "Нет нотификации от сервиса Тинькофф для идентификатора запроса"); 
	Ошибки.Вставить(20007, "Ошибка взаимодействия с сервисом ФНС"); 
	Ошибки.Вставить(20008, "Ошибка взаимодействия с сервисом Финстар");
	Ошибки.Вставить(20010, "Ошибка взаимодействия с сервисом СМЭВ"); 
	Ошибки.Вставить(20011, "Ошибка взаимодействия с сервисом СМЭВ-МВД"); 
	Ошибки.Вставить(20012, "Ошибка взаимодействия с сервисом СМЭВ-ФНС"); 
	Ошибки.Вставить(20013, "Ошибка взаимодействия с сервисом СМЭВ-СФР");
	
	
	/////////////// Ошибки валидации входных данных
	Ошибки.Вставить(30000, "Исключительная не предусмотренная ситуация");
	Ошибки.Вставить(30001, "Исключительная ситуация преобразования данных");
	Ошибки.Вставить(30002, "Исключительная ситуация регистрации контрагента");
	Ошибки.Вставить(30003, "Ошибочные данные настроек организации");
	Ошибки.Вставить(30004, "Не найден документ открытия договора");
	Ошибки.Вставить(30005, "Неизвестный документ открытия договора");
	Ошибки.Вставить(30006, "Подозрение на несанкционированный асинхронный вызов команды");
	Ошибки.Вставить(30007, "Исключительная ситуация формирования печатной формы");
	Ошибки.Вставить(30008, "Исключительная ситуация расшифровки полученных данных");
	Ошибки.Вставить(30009, "Неизвестная печатная форма");
	Ошибки.Вставить(30010, "Неизвестный документ печатной формы");
	Ошибки.Вставить(30011, "Не найдена заявка онлайн для документа");
	Ошибки.Вставить(30012, "Не найден действующий документ с УникальныйИдентификатор");						   
	Ошибки.Вставить(30013, "Не найден документ для контрагента");
	Ошибки.Вставить(30014, "Не настроены параметры для использования платежей или не возможно использование сейчас");
	Ошибки.Вставить(30015, "Нет платежного оператора с таким названием");
	Ошибки.Вставить(30016, "Для данного платежного оператора нет обязательного параметра");
	Ошибки.Вставить(30017, "Для данного платежного оператора нет реализации команды");
	Ошибки.Вставить(30018, "Для данной организации нет личного кабинета");
	Ошибки.Вставить(30019, "Исключительная ситуация получения карты по идентификатору");
	Ошибки.Вставить(30020, "Ошибка в нотификации при регистрации карты");
	Ошибки.Вставить(30021, "Исключительная ситуация создания элемента справочника ПушУведомления");
	Ошибки.Вставить(30022, "Запрос добавления карты с таким идентификатором не найден");
	Ошибки.Вставить(30023, "Есть открытая заявка");
	Ошибки.Вставить(30024, "Исключительная ситуация создания заявки");
	Ошибки.Вставить(30025, "Исключительная ситуация вызова сервиса Jetap");
	Ошибки.Вставить(30026, "Ошибки обработки фотографий заявки");
	Ошибки.Вставить(30027, "Ошибка при получении графика платежей");
	Ошибки.Вставить(30028, "Неизвестное название перечисления РеквизитыАнкетыЗаявления");
	Ошибки.Вставить(30029, "Ошибка взаимодействия с платежным оператором");
	Ошибки.Вставить(30030, "Не найден участник СБП по идентификатору");
	Ошибки.Вставить(30031, "Нет одного из обязательных параметров для преполагаемой выплаты по СБП или на карту");
	Ошибки.Вставить(30032, "Ошибка отклонения заявки на карту. Есть подписанный договор по данной заявке"); // 04.02.2026 Росин
	
	
	/////////////// Логические и прикладные ошибки (ошибки в процессе выполнения основных методов)
	Ошибки.Вставить(40000, "Исключительная ситуация выполнения метода");
	Ошибки.Вставить(40001, "Ошибка обработки параметра ...");
	Ошибки.Вставить(40002, "Ошибка обработки параметра links");
	Ошибки.Вставить(40003, "Ошибка обработки параметра ...");
	Ошибки.Вставить(40004, "Ошибка удаленного выполнения команды");
	Ошибки.Вставить(40005, "Нет кассы с таким наименованием.");
	Ошибки.Вставить(40006, "Вызываемая команда запрещена для выполнения.");
	Ошибки.Вставить(40007, "Обработчик команды на стороне сервера настроен некорректно.");

	Ошибки.Вставить(40010, "Ошибка входных параметров метода.");
	Ошибки.Вставить(40011, "Ошибка получения данных по переданным параметрам.");
	Ошибки.Вставить(40012, "Ошибка при загрузке данных из файла.");
	
	/////////////// Ошибки внешних провайдеров (внешних сервисов)
	Ошибки.Вставить(60001, "Нет данных для 5СД");
	
	Возврат Ошибки;
КонецФункции

Функция ПолучитьНастройкиПодключения(ИмяСервисаHTTP, ИмяКонфигурации) Экспорт
	Настройки = Неопределено;
	
	// Определение боевой/тестовой базы
	СтрокаСоединения = СтрокаСоединенияИнформационнойБазы();
	
	ИмяБазыНаСервере = НРег(СтрокаСоединения); 
	ИменаБоевыхБаз = НРег("Crematory_cent,UGK,ugk_crematory");
	
	ЭтоБоевойКонтур = Ложь;
	Для Каждого Строка Из СтрРазделить(ИменаБоевыхБаз, ",") Цикл
		ЭтоБоевойКонтур = (ИмяБазыНаСервере = Строка);
		
		Если ЭтоБоевойКонтур Тогда
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	Если ИмяСервисаHTTP = "оо_HTTPОбмен" Тогда
		Настройки = Новый Структура;
		Настройки.Вставить("ИмяСервера", "srv-db4");
		Настройки.Вставить("Порт", 80);
		Настройки.Вставить("Пользователь", "http_exchange");
		
		Если СтрНайти(ИмяКонфигурации, "УправлениеРитуальнымиУслугами") <> 0 Тогда 
			// Настройки для базы "Управление ритуальными услугами"
			Если ЭтоБоевойКонтур Тогда
				Настройки.Вставить("Пароль", "");
				Настройки.Вставить("ПрефиксПути", "/UGK"); // Отправляем в боевую Бухгалтерию
			Иначе
				Настройки.Вставить("Пароль", "");
				Настройки.Вставить("ПрефиксПути", "/UGK_test"); // Отправляем в тестовую Бухгалтерию
			КонецЕсли;
			
		ИначеЕсли СтрНайти(ИмяКонфигурации, "БухгалтерияПредприятия") <> 0 Тогда
			// Настройки для базы "БухгалтерияПредприятия"
			Если ЭтоБоевойКонтур Тогда
				Настройки.Вставить("Пароль", "");
				Настройки.Вставить("ПрефиксПути", "/Crematory_cent"); // Отправляем в боевой Крематорий
			Иначе
				Настройки.Вставить("Пароль", "");
				Настройки.Вставить("ПрефиксПути", "/test_crematory_cent"); // Отправляем в тестовый Крематорий
			КонецЕсли;
		
		Иначе
			Настройки = Неопределено;
		КонецЕсли;
	КонецЕсли;
	
	Возврат Настройки;
КонецФункции

Функция ПроверитьИРазобратьВходныеПараметрыЗапроса(тзСообщений, Запрос, ОписаниеПараметровЗапроса) Экспорт
	ИмяФункции = "ПроверитьИРазобратьВходныеПараметрыЗапроса";
	
	///////////////// ПАРАМЕТРЫ ИЗ ЗАГОЛОВКОВ - Надо передать строку 'ИмяЗаголовка'
	//// Параметры передаются в заголовке в формате Base64
	//СтрокаПараметровBase64 = Запрос.Заголовки.Получить(ИмяЗаголовка);
	//
	//Если Не ЗначениеЗаполнено(СтрокаПараметровBase64) Тогда
	//	оо_HTTPСервер.СформироватьСообщениеДляЛога(тзСообщений
	//							, ИмяФункции
	//							, "Отсутствуют параметры в заголовке запроса " + ИмяЗаголовка
	//							, 40010);
	//	
	//	Возврат Неопределено;
	//КонецЕсли;
	//
	//// Получение строки JSON
	//Попытка
	//	ДвоичныеДанныеJSON = ПолучитьДвоичныеДанныеИзBase64Строки(СтрокаПараметровBase64);
	//	СтрокаJSON = ПолучитьСтрокуИзДвоичныхДанных(ДвоичныеДанныеJSON, КодировкаТекста.UTF8);
	//Исключение
	//	оо_HTTPСервер.СформироватьСообщениеДляЛога(тзСообщений
	//							, ИмяФункции
	//							, ПодробноеПредставлениеОшибки(ИнформацияОбОшибке())
	//							, 40011);
	//	
	//	Возврат Неопределено;
	//КонецПопытки;
	
	// Получение строки параметров
	СтрокаJSON = Запрос.ПолучитьТелоКакСтроку();
	
	Если Не ЗначениеЗаполнено(СтрокаJSON) Тогда
		Если ПроверитьОбязательностьПараметров(ОписаниеПараметровЗапроса) Тогда
			оо_HTTPСервер.СформироватьСообщениеДляЛога(тзСообщений, ИмяФункции, "Пустая строка JSON", 10001);
			
			Возврат Неопределено;
		КонецЕсли;
		
		Возврат "";
	КонецЕсли;
	
	// Получение структуры параметров
	Попытка
		СтруктураПараметров = JSONВЗначение(СтрокаJSON,, Ложь);
	Исключение
		оо_HTTPСервер.СформироватьСообщениеДляЛога(тзСообщений, ИмяФункции, ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()), 10002);
		
		Возврат Неопределено;
	КонецПопытки;
	
	Если ТипЗнч(СтруктураПараметров) <> Тип("Структура") Тогда
		оо_HTTPСервер.СформироватьСообщениеДляЛога(тзСообщений, ИмяФункции, "Ошибка метода 'JSONВЗначение'", 10002);
		
		Возврат Неопределено;
	КонецЕсли;
	
	// Проверка параметров
	РезультатПроверкиПараметровЗапроса = ПроверитьПараметрыЗапроса(СтруктураПараметров, ОписаниеПараметровЗапроса, Истина);
	
	Если РезультатПроверкиПараметровЗапроса.Код <> 0 Тогда
		оо_HTTPСервер.СформироватьСообщениеДляЛога(тзСообщений
								, "ПроверитьПараметрыЗапроса"
								, "Ошибка при проверке параметров запроса"
								, РезультатПроверкиПараметровЗапроса.Код);
		
		Возврат Неопределено;
	КонецЕсли;
	
	Возврат СтруктураПараметров;
КонецФункции

Функция ПроверитьОбязательностьПараметров(ОписаниеПараметровЗапроса)
	Для Каждого Описание из ОписаниеПараметровЗапроса Цикл
		Если Описание.Значение.Обязательность Тогда
			Возврат Истина;
		КонецЕсли;
	КонецЦикла;
	
	Возврат Ложь;
КонецФункции

Функция ПроверитьПараметрыЗапроса(СтруктураПараметров, ОписаниеПараметровЗапроса, ПроверятьВсеПараметрыНаПустоту = Ложь)
	ОшибкиПротоколаОбмена = ОшибкиПротоколаОбмена();
	ОбработанныеПараметры = Новый Соответствие;
	
	Для Каждого Описатель Из ОписаниеПараметровЗапроса Цикл
		ПараметрЗначение = Неопределено;
		
		Если СтруктураПараметров.Свойство(Описатель.Ключ, ПараметрЗначение) Тогда
			// есть параметр в запросе
			Если Описатель.Значение.Тип = Тип("УникальныйИдентификатор") Тогда
				Если Не СтроковыеФункцииКлиентСервер.ЭтоУникальныйИдентификатор(ПараметрЗначение) Тогда
					// ошибка: несоответствие типа УникальныйИдентификатор
					Возврат Новый Структура("Код,Сообщение", 10005, Описатель.Ключ);
				КонецЕсли;
				
			ИначеЕсли ТипЗнч(ПараметрЗначение) <> Описатель.Значение.Тип Тогда
				// ошибка: несоответствие типа
				Возврат Новый Структура("Код,Сообщение", 10005, Описатель.Ключ);
				
			КонецЕсли;
			
			Если ПроверятьВсеПараметрыНаПустоту ИЛИ Описатель.Значение.Обязательность Тогда
				Если	  Описатель.Значение.Тип = Тип("Число") Тогда
					// число может приходить любого значения, значение 0 тоже считается безошибочным
					
				ИначеЕсли Описатель.Значение.Тип = Тип("УникальныйИдентификатор") Тогда
					Если Не СтроковыеФункцииКлиентСервер.ЭтоУникальныйИдентификатор(ПараметрЗначение) Тогда
						// ошибка: несоответствие типа УникальныйИдентификатор
						Возврат Новый Структура("Код,Сообщение", 10005, Описатель.Ключ);
					КонецЕсли;
					
				ИначеЕсли (Описатель.Значение.Тип = Тип("Строка") И ПустаяСтрока(ПараметрЗначение))
					Или Не ЗначениеЗаполнено(ПараметрЗначение) Тогда
					// ошибка: передано пустое значение параметра
					Возврат Новый Структура("Код,Сообщение", 10006, Описатель.Ключ);
					
				КонецЕсли;
			КонецЕсли;
			
			ОбработанныеПараметры.Вставить(Описатель.Ключ, ПараметрЗначение);
		ИначеЕсли Описатель.Значение.Обязательность Тогда
			// Ошибка: нет обязательного параметра
			Возврат Новый Структура("Код,Сообщение", 10003, Описатель.Ключ);
		КонецЕсли;
	КонецЦикла;
	
	Если СтруктураПараметров.Количество() > ОбработанныеПараметры.Количество() Тогда
		// Ошибка: передан неизвестный параметр
		Возврат Новый Структура("Код,Сообщение", 10007, "");
	КонецЕсли;
	
	Возврат Новый Структура("Код,Сообщение", 0, "");
КонецФункции

Функция ОтветНаЗапрос(ДанныеКоманды) Экспорт
	ДанныеКоманды.Ответ.Заголовки.Вставить("Content-Type","application/json charset=utf-8");
	
	СтруктураОтвета = Новый Структура;
	errCode    = 0;
	errMessage = "";
	
	Если ДанныеКоманды.тзСообщений.Количество() > 0 Тогда
		// Ошибка?
		ПоследняяСтрока = ДанныеКоманды.тзСообщений[ДанныеКоманды.тзСообщений.Количество() - 1];
		
		Если ПоследняяСтрока.КодОшибки > 0 И ПоследняяСтрока.КодОшибки < 60000 Тогда
			// Ошибка!
			МассивСообщений = ДанныеКоманды.тзСообщений.ВыгрузитьКолонку("Сообщение");
			
			errCode		= ПоследняяСтрока.КодОшибки;
			errMessage	= СтрСоединить(МассивСообщений, "; ");
		КонецЕсли;
	КонецЕсли;
	
	СтруктураОтвета.Вставить("errCode",    Формат(errCode, "ЧН=0; ЧГ=0"));
	СтруктураОтвета.Вставить("errMessage", errMessage);
	
	Если errCode = 0 Тогда
		// Успешно
		Для Каждого Параметр из ДанныеКоманды.ПараметрыОтвета Цикл
			СтруктураОтвета.Вставить(Параметр.Ключ, Строка(Параметр.Значение));
		КонецЦикла;	
	КонецЕсли;

	Попытка
		СтрокаJSON = ЗначениеВJSON(СтруктураОтвета);
	Исключение
		оо_HTTPСервер.ЗаписьЖурнала("ОтветНаЗапрос", "Объект ответа не удалось сериализовать. " + ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
		СтрокаJSON = "";
	КонецПопытки;
	
	Если Не ЗначениеЗаполнено(СтрокаJSON) Тогда
		// Исключение при преобразовании данных в JSON
		КодОшибки = 30001;
		ОписаниеОшибки = ОшибкиПротоколаОбмена()[КодОшибки];
		
		СтруктураОтвета = Новый Структура;
		СтруктураОтвета.Вставить("errCode",    Формат(КодОшибки, "ЧН=0; ЧГ=0"));
		СтруктураОтвета.Вставить("errMessage", ОписаниеОшибки);
		
		СтрокаJSON = ЗначениеВJSON(СтруктураОтвета);
		
		оо_HTTPСервер.ЗаписьЖурнала("ОтветНаЗапрос", "Исключение при преобразовании данных в JSON. " + ОписаниеОшибки + " Код ошибки: " + КодОшибки);
	КонецЕсли;
	
	ДанныеКоманды.Ответ.УстановитьТелоИзСтроки(СтрокаJSON, КодировкаТекста.UTF8);
	
	Возврат ДанныеКоманды.Ответ;
КонецФункции

Функция ЗначениеВJSON(Знач Значение)
	ЗаписьJSON = Новый ЗаписьJSON;
	ЗаписьJSON.УстановитьСтроку();
	ЗаписатьJSON(ЗаписьJSON, Значение);
	
	Возврат ЗаписьJSON.Закрыть();
КонецФункции

Функция JSONВЗначение(Знач Строка, Знач ИменаСвойствСоЗначениямиДата = Неопределено, Знач ПрочитатьВСоответствие = Истина)
	Если ТипЗнч(ИменаСвойствСоЗначениямиДата) = Тип("Строка") Тогда
		ИменаСвойствСоЗначениямиДата = СтрРазделить(ИменаСвойствСоЗначениямиДата, ", " + Символы.ПС, Ложь);
	КонецЕсли;
	
	ЧтениеJSON = Новый ЧтениеJSON;
	ЧтениеJSON.УстановитьСтроку(Строка);
	
	Возврат ПрочитатьJSON(ЧтениеJSON, ПрочитатьВСоответствие, ИменаСвойствСоЗначениямиДата);
КонецФункции

