Функция СтруктураДанныеКоманды() Экспорт
	ДанныеКоманды = Новый Структура;
	
	тзСообщений = Новый ТаблицаЗначений;
	тзСообщений.Колонки.Добавить("Сообщение",	Новый ОписаниеТипов("Строка"));
	тзСообщений.Колонки.Добавить("КодОшибки",	Новый ОписаниеТипов("Число"));
	
	ДанныеКоманды.Вставить("Команда",				"");
	ДанныеКоманды.Вставить("Запрос",				Неопределено);
	ДанныеКоманды.Вставить("Ответ",					Неопределено);
	ДанныеКоманды.Вставить("тзСообщений",			тзСообщений);
	ДанныеКоманды.Вставить("ДанныеЛога",			Новый Структура);
	ДанныеКоманды.Вставить("СессияКлиента",			"");
	ДанныеКоманды.Вставить("ОбязательноВЛог",		Истина); // ИСТИНА = писать все события
	ДанныеКоманды.Вставить("Документ",				Неопределено);
	ДанныеКоманды.Вставить("Телефон",				"");
	ДанныеКоманды.Вставить("УИДКонтрагента",		"");
	ДанныеКоманды.Вставить("IPКлиента",				"");
	ДанныеКоманды.Вставить("ПараметрыОтвета",		Новый Структура);
	ДанныеКоманды.Вставить("ДопОбработкаОтвета",	Неопределено);
	
	Возврат ДанныеКоманды;
КонецФункции

Функция ВыполнитьЗагрузкуДанныхИзФайла(ДанныеКоманды, ПринятыеДвоичныеДанные) Экспорт
	ИмяФункции = "ВыполнитьЗагрузкуДанныхИзФайла";
	тзСообщений = ДанныеКоманды.тзСообщений;
	
	Попытка
		// Временный файл для обработки
		ИмяВременногоФайла = ПолучитьИмяВременногоФайла("xml");
		ПринятыеДвоичныеДанные.Записать(ИмяВременногоФайла);
	Исключение
		оо_HTTPСервер.СформироватьСообщениеДляЛога(тзСообщений
												, ИмяФункции
												, ПодробноеПредставлениеОшибки(ИнформацияОбОшибке())
												, 30001);
		
		Возврат Неопределено;
	КонецПопытки;
	
	//// Заккоментировал - формирование сообщения через файл
	//// Второй временный файл — для протокола ошибок
	//ИмяФайлаПротокола = ПолучитьИмяВременногоФайла("txt");
	//ОбработкаОбмена.ИмяФайлаПротоколаОбмена = ИмяФайлаПротокола;
	
	Попытка
		// Работаем через штатную обработку
		ОбработкаОбменаМенеджер = Обработки["УниверсальныйОбменДаннымиXML"];
		ОбработкаОбмена = ОбработкаОбменаМенеджер.Создать();
		//ОбработкаОбмена = Обработки.УниверсальныйОбменДаннымиXML.Создать();
		
		// Настройка параметров
		ОбработкаОбмена.РежимОбмена = "Загрузка";
		ОбработкаОбмена.ИмяФайлаОбмена = ИмяВременногоФайла;
		
		ОбработкаОбмена.ЗаписыватьРегистрыНаборамиЗаписей						= Истина;
		ОбработкаОбмена.ОптимизированнаяЗаписьОбъектов							= Истина;
		
		ОбработкаОбмена.ЗагружатьДанныеВРежимеОбмена							= Истина;
		ОбработкаОбмена.ЗаписыватьВИнформационнуюБазуТолькоИзмененныеОбъекты	= Истина;
		ОбработкаОбмена.ОбъектыПоСсылкеЗагружатьБезПометкиУдаления				= Истина;
		
		ОбработкаОбмена.ВыводВПротоколСообщенийОбОшибках						= Истина;
		ОбработкаОбмена.ВыводВОкноСообщенийИнформационныхСообщений				= Ложь;
		
		// Загрузка данных файла
		ОбработкаОбмена.ВыполнитьЗагрузку();
	Исключение
		оо_HTTPСервер.СформироватьСообщениеДляЛога(тзСообщений
												, ИмяФункции
												, ПодробноеПредставлениеОшибки(ИнформацияОбОшибке())
												, 40012);
		
		Возврат Неопределено;
	КонецПопытки;
	
	ТекстСообщения = "";
	
	// Данные из системного окна сообщений - формируем сообщение для ответа
	МассивСообщений = ПолучитьСообщенияПользователю(Истина);
	Для Каждого ТекСообщение Из МассивСообщений Цикл
		ТекстСообщения = ТекстСообщения + ТекСообщение.Текст;
	КонецЦикла;
	
	// Удаляем временные файлы
	Попытка УдалитьФайлы(ИмяВременногоФайла); Исключение КонецПопытки;
	//Попытка УдалитьФайлы(ИмяФайлаПротокола); Исключение КонецПопытки;
	
	Если ОбработкаОбмена.ФлагОшибки Тогда
		//// Заккоментировал - формирование сообщения через файл
		//// Получение данных из файла протокола, куда обработка записала ошибку.
		//ПротоколФайл = Новый Файл(ИмяФайлаПротокола);
		//Если ПротоколФайл.Существует() Тогда
		//	ТекстПротокола = Новый ТекстовыйДокумент;
		//	ТекстПротокола.Прочитать(ИмяФайлаПротокола, КодировкаТекста.ANSI);
		//	ТекстОшибки = ТекстОшибки + ТекстПротокола.ПолучитьТекст();
		//КонецЕсли;
		
		оо_HTTPСервер.СформироватьСообщениеДляЛога(тзСообщений, ИмяФункции, ТекстСообщения, 40012);
		
		Возврат Неопределено;
	КонецЕсли;
	
	// Успешное выполнение - запишем сообщение для трансляции Пользователю)
	ДанныеКоманды.ПараметрыОтвета.Вставить("Сообщение", "Данные успешно загружены в базе-приемнике " + ТекстСообщения);
	
	Возврат "";
КонецФункции

Процедура СформироватьСообщениеДляЛога(тзСообщений, ИмяМетода = "", ДопСообщение = "", КодОшибки = 0, ЗаписатьВЖурналРегистрации = Истина) Экспорт
	СообщениеОбОшибке = "";
	
	Если КодОшибки > 0 Тогда
		СообщениеОбОшибке = оо_ФункцииДляРаботыСНТТР.ОшибкиПротоколаОбмена()[КодОшибки];
		Если СообщениеОбОшибке = Неопределено Тогда
			СообщениеОбОшибке = "";
		КонецЕсли;
	КонецЕсли;
	
	Если Не ПустаяСтрока(Строка(ДопСообщение)) Тогда
		СообщениеОбОшибке = СообщениеОбОшибке + " [" + ДопСообщение + "]";
	КонецЕсли;
	
	ДобавитьСообщениеВ_ТЗ(тзСообщений, СообщениеОбОшибке, КодОшибки);
	
	Если ЗаписатьВЖурналРегистрации Тогда
		ЗаписьЖурнала(ИмяМетода, СообщениеОбОшибке);
	КонецЕсли;
КонецПроцедуры

Процедура ДобавитьСообщениеВ_ТЗ(тзСообщений, СообщениеОбОшибке, КодОшибки)
	Стр = тзСообщений.Добавить();
	Стр.Сообщение = СообщениеОбОшибке;
	Стр.КодОшибки = КодОшибки;
КонецПроцедуры

Процедура ЗаписьЖурнала(ИмяМетода, Комментарий, УровеньЖурнала = Неопределено) Экспорт
	Если Комментарий = "" Тогда
		Возврат
	КонецЕсли;
	
	МетаданныеЖурнала = Метаданные.ОбщиеМодули.оо_ФункцииДляРаботыСНТТР;
	
	ИмяСобытия = МетаданныеЖурнала.Имя + "." + ИмяМетода;
	
	Если УровеньЖурнала = Неопределено Тогда
		УровеньЖурнала = УровеньЖурналаРегистрации.Ошибка;
	КонецЕсли;
	
	ЗаписьЖурналаРегистрации(ИмяСобытия, УровеньЖурнала, МетаданныеЖурнала,, Комментарий);
КонецПроцедуры

